{
    "header": {
        "heading": "<strong>Kirill Ivanov</strong> <br/>Frontend developer",
        "text": "I develop SPA and multi page apps made with React",
        "button": "More"
    },
    "section1": {
        "heading": "My skills",
        "text1": "I have 4 years of experience as a front-end developer in E-commerce. I participated in the development of online stores for such companies as Nespresso, L'oreal, AAG Estate.",
        "text2": "Working on various projects, I implemented integration with Yandex Maps API via REST requests, worked on creating cross-browser and adaptive pixel perfect layouts using psd or figma, and also worked with ES5 and jQuery library.  Currently I only work with ES6+."
    },
    "technologies": {
        "heading": "Technologies that I use:",
        "text1": "I mainly use Javascript to develop the front end part of the application. I use React to quickly build a client-side of a website of any complexity and Redux as a way to manage app's state",
        "text2": "I work with Next.js to develop multi-page websites with full SEO support. Working with the API I prefer to use Graphql because of its convenience and simplicity. I often use the material-ui library as a mean to quickly and easily create adaptive components."
    },
    "work": {
        "heading": "My work",
        "text": "Examples of work, made with React/Next.js, or vanilla JS with jQuery",
        "rickandmorty": {
            "heading": "Rick and Morty Database",
            "text": "Multi page website made with Next.js, using Graphql for API requests"
        },
        "movies": {
            "heading": "Movies Database",
            "text": "SPA made with React and Redux to preserve search results. REST requests are used to receive data"
        },
        "lehair": {
            "heading": "Le Hair landing",
            "text": "Landing page made with html/scss/jquery"
        },
        "code": "code",
        "source": "source",
        "live": "live"
    }
}
